jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F0xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Geehy</vendor>
    <url>https://www.geehy.com/uploads/tool/</url>
    <supportContact>https://www.geehy.com/support/apm</supportContact>
    <name>APM32F0xx_DFP</name>
    <description>Geehy Semiconductor APM32F0xx Series Device Support</description>
    <releases>
        <release version="1.0.0" date="2020-06-15">
First Release version of APM32F0xx Device Family Pack.
        </release>
        <release version="1.0.1" date="2020-09-25">Change the url,description,vendor.</release>
        <release version="1.0.2" date="2020-11-04">Fix some bugs,add APM32F030 Device.</release>
        <release version="1.0.3" date="2020-11-13">add APM32F07x Device.</release>
        <release version="1.0.4" date="2021-02-22">Add new devices:
 - APM32F030xC,
 - APM32F051x6, APM32F051x8, 
 - APM32F091xB, APM32F091xC,
Updated SVD files.</release>
        <release version="1.0.5" date="2021-04-26">Add APM32F091 Device.
Updated APM32F091 SVD files.</release>
        <release version="1.0.6" date="2021-07-01">Updated the Device to V1.0.1
Updated the SVD files.</release>
        <release version="1.0.7" date="2022-02-21">Updated the Device to V1.0.2
        </release>
        <release version="1.0.8" date="2022-09-20">Updated the Device to V1.0.3
        </release>
        <release version="1.0.9" date="2022-11-29">Add new devices:
- APM32F030Fx,
- APM32F030Gx,</release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32F0x</keyword>
        <keyword>APM32F0</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32F0 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
            <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
            <description>
        Geehy Semiconductor' APM32F0 series of mainstream MCUs are 32-bit microprocessors based on ARM Cortex'-M0+ core, with a maximum operating frequency of 48MHz.
        Core
        - ARM 32-bit Cortex-M0+ CPU (48 MHz max)
        Memories
        - 32 to 256 Kbytes of Flash memory
        - 4 to 32 Kbytes of SRAM with HW parity checking
        CRC calculation unit
        Reset and power management
        - Voltage range: 2.4 V to 3.6 V
        - Power-on/Power down reset (POR/PDR)
        - Low power modes: Sleep, Stop, Standby
        Clock management
        - 4 to 32 MHz crystal oscillator
        - 32 kHz oscillator for RTC with calibration
        - Internal 8 MHz RC with x6 PLL option
        - Internal 40 kHz RC oscillator

            </description>
            <!-- ******************************  APM32F030  ****************************** -->
            <subFamily DsubFamily="APM32F030">
                <!-- ******************************  APM32F030F4  ****************************** -->
                <device Dname="APM32F030F4">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X4"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x4000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="15" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="0" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="1" name="USART Interface"/>
                </device><!-- ******************************  APM32F030F6  ****************************** --><device Dname="APM32F030F6">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X6"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="15" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="0" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="1" name="USART Interface"/>
                </device><!-- ******************************  APM32F030F8  ****************************** --><device Dname="APM32F030F8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X8"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="15" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="0" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="1" name="USART Interface"/>
                </device><!-- ******************************  APM32F030G4  ****************************** --><device Dname="APM32F030G4">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X4"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x4000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="6" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="23" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="1" name="Comparator"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="1" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="1" name="USART Interface"/>
                </device><!-- ******************************  APM32F030G6  ****************************** --><device Dname="APM32F030G6">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X6"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="6" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="23" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="1" name="Comparator"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="1" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="2" name="USART Interface"/>
                </device><!-- ******************************  APM32F030G8  ****************************** --><device Dname="APM32F030G8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X8"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="23" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="1" name="Comparator"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="1" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="2" name="USART Interface"/>
                </device><!-- ******************************  APM32F030K6  ****************************** --><device Dname="APM32F030K6">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X6"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="25" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/>
                    <feature type="Com" count="1" name="SPI Interface"/>
                    <feature type="Com" count="0" name="I2S Interface"/>
                    <feature type="Com" count="1" name="I2C Interface"/>
                    <feature type="Com" count="1" name="USART Interface"/>
                </device>
                <!-- ******************************  APM32F030C6  ****************************** -->
                <device Dname="APM32F030C6">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X6"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="39" name="Input and Output Ports"/><feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/><feature type="Com" count="1" name="SPI Interface"/><feature type="Com" count="0" name="I2S Interface"/><feature type="Com" count="1" name="I2C Interface"/><feature type="Com" count="1" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
                <!-- ******************************  APM32F030K8  ****************************** -->
                <device Dname="APM32F030K8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X8"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="25" name="Input and Output Ports"/><feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/><feature type="Com" count="1" name="SPI Interface"/><feature type="Com" count="0" name="I2S Interface"/><feature type="Com" count="1" name="I2C Interface"/><feature type="Com" count="1" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
                <!-- ******************************  APM32F030C8  ****************************** -->
                <device Dname="APM32F030C8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X8"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="39" name="Input and Output Ports"/><feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/><feature type="Com" count="2" name="SPI Interface"/><feature type="Com" count="0" name="I2S Interface"/><feature type="Com" count="2" name="I2C Interface"/><feature type="Com" count="2" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
                <!-- ******************************  APM32F030R8  ****************************** -->
                <device Dname="APM32F030R8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030X8"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="55" name="Input and Output Ports"/><feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/><feature type="Com" count="2" name="SPI Interface"/><feature type="Com" count="0" name="I2S Interface"/><feature type="Com" count="2" name="I2C Interface"/><feature type="Com" count="2" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
                <!-- ******************************  APM32F030CC  ****************************** -->
                <device Dname="APM32F030CC">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030XC"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x8000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_256.FLM" start="0x08000000" size="0x40000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="8" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="37" name="Input and Output Ports"/><feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/><feature type="Com" count="2" name="SPI Interface"/><feature type="Com" count="0" name="I2S Interface"/><feature type="Com" count="2" name="I2C Interface"/><feature type="Com" count="6" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
