jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F0xx_DFP.pdsc
                <!-- ******************************  APM32F030RC  ****************************** -->
                <device Dname="APM32F030RC">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F030XC"/>
                    <debug svd="SVD\APM32F030.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x8000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_256.FLM" start="0x08000000" size="0x40000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="8" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="0" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    
                    
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="51" name="Input and Output Ports"/>
                    <feature type="D/A" count="0" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="0" name="Comparator"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="0" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="6" name="USART Interface"/>
                </device>
            </subFamily>
            <!-- ******************************  APM32F051  ****************************** -->
            <subFamily DsubFamily="APM32F051">
                <!-- ******************************  APM32F051K6  ****************************** -->
                <device Dname="APM32F051K6">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F051X6"/>
                    <debug svd="SVD\APM32F051.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="27" name="Input and Output Ports"/><feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="2" name="Comparator"/><feature type="Com" count="1" name="SPI Interface"/><feature type="Com" count="1" name="I2S Interface"/><feature type="Com" count="1" name="I2C Interface"/><feature type="Com" count="2" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
                <!-- ******************************  APM32F051K8  ****************************** -->
                <device Dname="APM32F051K8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F051X8"/>
                    <debug svd="SVD\APM32F051.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="27" name="Input and Output Ports"/><feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="2" name="Comparator"/><feature type="Com" count="1" name="SPI Interface"/><feature type="Com" count="1" name="I2S Interface"/><feature type="Com" count="1" name="I2C Interface"/><feature type="Com" count="2" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
                <!-- ******************************  APM32F051C6  ****************************** -->
                <device Dname="APM32F051C6">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F051X6"/>
                    <debug svd="SVD\APM32F051.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/><feature type="Timer" count="7" name="16-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/><feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/><feature type="I/O" count="39" name="Input and Output Ports"/><feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/><feature type="COMP" count="2" name="Comparator"/><feature type="Com" count="1" name="SPI Interface"/><feature type="Com" count="1" name="I2S Interface"/><feature type="Com" count="1" name="I2C Interface"/><feature type="Com" count="2" name="USART Interface"/>

                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    
                </device>
