jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F0xx_DFP.pdsc
                <!-- ******************************  APM32F072RB  ****************************** -->
                <device Dname="APM32F072RB">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F072XB"/>
                    <debug svd="SVD\APM32F072.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_128.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="51" name="Input and Output Ports"/>
                    <feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="2" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="4" name="USART Interface"/>
                    <feature type="Com" count="1" name="CAN Interface"/>
                </device>
                <!-- ******************************  APM32F072R8  ****************************** -->
                <device Dname="APM32F072R8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F072X8"/>
                    <debug svd="SVD\APM32F072.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="51" name="Input and Output Ports"/>
                    <feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="2" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="4" name="USART Interface"/>
                    <feature type="Com" count="1" name="CAN Interface"/>
                </device>
                <!-- ******************************  APM32F072CB ****************************** -->
                <device Dname="APM32F072CB">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F072XB"/>
                    <debug svd="SVD\APM32F072.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_128.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="37" name="Input and Output Ports"/>
                    <feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="2" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="4" name="USART Interface"/>
                    <feature type="Com" count="1" name="CAN Interface"/>
                </device>
                <!-- ******************************  APM32F072C8  ****************************** -->
                <device Dname="APM32F072C8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F072X8"/>
                    <debug svd="SVD\APM32F072.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="37" name="Input and Output Ports"/>
                    <feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="2" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="4" name="USART Interface"/>
                    <feature type="Com" count="1" name="CAN Interface"/>
                </device>
            </subFamily>

            <!-- ******************************  APM32F071  ****************************** -->
            <subFamily DsubFamily="APM32F071">
                <!-- ******************************  APM32F072V8 ****************************** -->
                <device Dname="APM32F071V8">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F071X8"/>
                    <debug svd="SVD\APM32F071.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="5" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="87" name="Input and Output Ports"/>
                    <feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="2" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="4" name="USART Interface"/>
                </device>
