jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F0xx_DFP.pdsc
                <!-- ******************************  APM32F091VC  ****************************** -->
                <device Dname="APM32F091VC">
                    <processor Dclock="48000000"/>
                    <compile header="Device\Device\Geehy\APM32F0xx\Include\apm32f0xx.h" define="APM32F091XC"/>
                    <debug svd="SVD\APM32F091.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x8000" init="0" default="1"/>
                    <algorithm name="Flash\APM32F0xx_256.FLM" start="0x08000000" size="0x40000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F0xx Data Sheet"/>

                    <feature type="Timer" count="8" name="16-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="1" name="32-Bit Timer with Input Capture, Output Compare and PWM"/>
                    <feature type="Timer" count="2" name="Watchdog"/>
                    <feature type="Timer" count="1" name="RTC"/>
                    <feature type="A/D" count="1" name="12-bit Analog to Digital Converter"/>
                    <feature type="I/O" count="88" name="Input and Output Ports"/>
                    <feature type="D/A" count="1" name="12-bit Digital to Analog Converter"/>
                    <feature type="Com" count="2" name="SPI Interface"/>
                    <feature type="Com" count="2" name="I2S Interface"/>
                    <feature type="Com" count="2" name="I2C Interface"/>
                    <feature type="Com" count="8" name="USART Interface"/>
                </device>





            </subFamily>
        </family>
    </devices>
    <conditions>
        <!-- conditions are dependecy rules that can apply to a component or an individual file -->
        <condition id="Compiler ARM">
            <!-- conditions selecting ARM Compiler -->
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F030">
            <description>Geehy Semiconductor APM32F030 Series devices</description>
            <require Dname="APM32F030??"/>
        </condition>
        <condition id="APM32F051">
            <description>Geehy Semiconductor APM32F051 Series devices</description>
            <require Dname="APM32F051??"/>
        </condition>
        <condition id="APM32F070">
            <description>Geehy Semiconductor APM32F070 Series devices</description>
            <require Dname="APM32F070??"/>
        </condition>
        <condition id="APM32F071">
            <description>Geehy Semiconductor APM32F071 Series devices</description>
            <require Dname="APM32F071??"/>
        </condition>
        <condition id="APM32F072">
            <description>Geehy Semiconductor APM32F072 Series devices</description>
            <require Dname="APM32F072??"/>
        </condition>
        <condition id="APM32F091">
            <description>Geehy Semiconductor APM32F091 Series devices</description>
            <require Dname="APM32F091??"/>
        </condition>
        <condition id="APM32F0xx CMSIS Device">
            <!-- conditions selecting Devices -->
            <description>Geehy Semiconductor APM32F0 Series devices and CMSIS-CORE</description>
            <require Cclass="CMSIS" Cgroup="CORE"/>
            <require Dvendor="Geehy:163" Dname="APM32F0????"/>
        </condition>
        <condition id="APM32F0xx STDPERIPH">
            <description>Geehy Semiconductor APM32F1xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32F0xx CMSIS Device"/>
            <require Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32F0xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32F1xx with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32F0xx CMSIS Device"/>
            <require Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="APM32F0xx Startup" Cversion="1.0.0" condition="APM32F0xx CMSIS Device">
            <!-- Cversion is necessary -->
            <description>System Startup for Geehy Semiconductor APM32F0xx Series</description>
            <files>
                <!-- startup files -->
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\arm\startup_apm32f030.s" attr="config" condition="APM32F030"/>
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\arm\startup_apm32f051.s" attr="config" condition="APM32F051"/>
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\arm\startup_apm32f070.s" attr="config" condition="APM32F070"/>
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\arm\startup_apm32f071.s" attr="config" condition="APM32F071"/>
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\arm\startup_apm32f072.s" attr="config" condition="APM32F072"/>
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\arm\startup_apm32f091.s" attr="config" condition="APM32F091"/>
                <!-- system file -->
                <file category="source" name="Device\Device\Geehy\APM32F0xx\Source\system_apm32f0xx.c" attr="config"/>
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="Framework" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/APM32F0xx_StdPeriphDriver/inc/"/>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_misc.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_misc.c"/>

