jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F0xx_DFP.pdsc
                <file category="header" name="Device/Templates/inc/apm32f0xx_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/src/apm32f0xx_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="ADC" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_adc.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="CAN" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_can.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="CEC" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>HDMI-CEC controller (CEC) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CEC </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_cec.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_cec.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="COMP" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Comparator (COMP) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_COMP </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_comp.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_comp.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="CRC" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>CRC calculation unit (CRC) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_crc.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="CRS" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Clock recovery system (CRS) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRS      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_crs.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_crs.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="DAC" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_dac.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_dac.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="DBG" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBG</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_dbg.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_dbg.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="DMA" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_dma.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="EINT" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_eint.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="FMC" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>Flash memory controller driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_fmc.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="GPIO" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_gpio.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="I2C" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_i2c.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="IWDT" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>Independent watchdog (IWDT) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_iwdt.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="PMU" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_pmu.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="RCM" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_rcm.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_rcm.c"/>
            </files>
        </component>
