jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F0xx_DFP.pdsc
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="RTC" Cversion="1.0.3" condition="APM32F0xx STDPERIPH">
            <description>Real-Time Clock (RTC) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_rtc.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_rtc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="SPI" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_spi.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="TMR" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_tmr.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_tmr.c"/>
            </files>
        </component>
        
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="USART" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_usart.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_usart.c"/>
            </files>
        </component>
        
        <component Cclass="Device" Cgroup="APM32F0xx StdPeriph Drivers" Csub="WWDT" Cversion="1.0.3" condition="APM32F0xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32F0xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F0xx_StdPeriphDriver/inc/apm32f0xx_wwdt.h"/>
                <file category="source" name="Device/APM32F0xx_StdPeriphDriver/src/apm32f0xx_wwdt.c"/>
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32F030MINI" revision="Ver 1.0">
            <description>Geehy APM32F030 Development Board</description>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F030R8"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F030"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="3" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="SW"/>
        </board>
        <board vendor="Geehy" name="APM32F072MINI" revision="Ver 1.0">
            <description>Geehy APM32F030 Development Board</description>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F072VB"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F072"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="3" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="SW"/>
        </board>
    </boards>
    <examples>
        <example name="APM32F030MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F030MINI/Blinky">
            <description>APM32F030_MINI  Blinky example</description>
            <board name="APM32F030MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F030MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
            </attributes>
        </example>
        <example name="APM32F072MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F072MINI/Blinky">
            <description>APM32F072_MINI  Blinky example</description>
            <board name="APM32F072MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F072MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
            </attributes>
        </example>
    </examples>
</package>